// Сума от цифрите на нечетни позиции на 6 цифрено число
#include <iostream>
using namespace std;
int main()
{
    // Декларираме целочислена променлива
    int n;

    // Извеждаме подканващ текст и въвеждаме числото
    cout << "Please enter 6 digits number:" << endl;
    cin >> n;

    // Отцепваме цифрите на четни позиции
    int a = (n / 100000) % 10;
    int b = (n / 1000) % 10;
    int c = (n / 10) % 10;

    // Намираме произведението
    int p = a * b * c;

    // Опечатваме получения резултат
    cout << p << endl;

    return 0;
}