// 08. Сума от цифрите на нечетни позиции на 5 цифрено число

#include <iostream>
using namespace std;
int main()
{
    // Създаване на променливите
    int a;

    // Въвеждане на петцифреното число
    cout << "a = ?" << endl;
    cin >> a;

    // Разделяне на цифрите на числото
    int a1 = (a / 10000) % 10;
    int a3 = (a / 100) % 10;
    int a5 = (a / 1) % 10;

    // Пресмятане на сумата от цифрите на нечетните позиции
    int s = a1 + a3 + a5;

    // Oтпечатване на резултата
    cout << "Sum = " << s << endl;

    return 0;
}