// 02. Сума на две цели числа
#include<iostream>
using namespace std;
int main()
	{
		//Създаване на две целочислени променливи
		int a = 2, b = 3;

		//Използване на математическа операция събиране 
		int c = a + b;

		//Отпечатване на резултата 
		cout << "sum" << c << endl;

		//Четири целочислени променливи
		int a, b, p, s,

			//Въвеждане на страните на правоъгълника
			cout << "a=";
		cin >> a;
		cout << "b=";
		cin >> b;

		//Изчисляване на лице и периметър
		p = 2 * (a + b);
		s = a * b;
		
		//Отпечатване резултата на екрана
		cout << "p=" << p << endl;
		cout << "s=" << s << endl;