// Произведение от цифрите на четните позиции на 6 цифрено цисло
#include <iostream>
using namespace std;
int main()
{
    // Декларираме целочислена променлива
    int n;

    // Извеждаме подканващ текст и въвеждаме числото
    cout << "Please enter 6 digits number:" << endl;
    cin >> n;

    // Отцепваме цифрите на четни позиции
    int a = (n / 100000) % 10;
    int b = (n / 1000) % 10;
    int c = (n / 10) % 10;

    // Намираме произведението има 
    int p = a * b * c;

    // Отпечатваме получения резулта
    cout << p << endl;

    return 0;
}
