#include <iostream>

using namespace std;
int main()
{
	/* Нарастващи суми Да се състави програма, която изчислява сума от следните суми: S =(n+m) + (n+2*m) + (n+3*m) +..+ (n+k*m). 
	Входни данни: n, m и k - естествени числа от интервала [2..10]. Използвайте цикъл за изчисляване на общата сума от нарастващите
	суми. Да се извеждат последователно всяка от формираните в цикъла сума. Вход Изход Пояснение 
	2 3 4 
	38 
	S=5+8+11+14 = 38 */


	int n, m, k;

	cin >> n;
	cin >> m;
	cin >> k;

	int sum = 0;
	for (int i = 1; i <= k; i++)
	{

		sum += (n + i * m);
		

		
	}
	cout << sum << endl;
}

