// 1. Редицата на фибоначи до зададено число (горна граница)
#include <iostream>
using namespace std;
int main()
{
    // Необходими целочислени променливи
    int n, a = 0, b = 1, c = a + b;

    // Въвеждане на горна граница
    cout << "Upper Limit: ";
    cin >> n;

    // Първи три елемента от редица на Фибоначи
    cout << a << " " << b << " " << c << " ";

    // Останали елементи от редицата на фибоначи
    while (c < n)
    {
        // Метод на плаващия прозорец
        a = b;
        b = c;
        c = a + b;
        
        // Отпечатване на екрана
        if (c < n)
        {
            cout << c << " ";
        }
    }

    return 0;
}