// Произведение от цифрите на четните позиции на 6 цифрено число
#include<iostream>
using namespace std;
int main()
{
    // Шестцифрено число
    int a;

    // Въвеждане на шестцифрено число
    cout << "a=?" << endl;
    cin >> a;

    // Отцепване четните цифри на числото
    int a2 = (a / 10000) % 10;
    int a4 = (a / 100) % 10;
    int a6 = (a / 1) % 10;

    // Сметки
    int p = a2 * a4 * a6;

    // Oтпечатване произведението на четните цифри на числото
    cout << p << endl;

    return 0;
}